In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('tips.csv')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

## Create Category

In [4]:
pd.Categorical(df.day)

['Sun', 'Sun', 'Sun', 'Sun', 'Sun', ..., 'Sat', 'Sat', 'Sat', 'Sat', 'Thur']
Length: 244
Categories (4, object): ['Fri', 'Sat', 'Sun', 'Thur']

## Ordered Categorical

In [8]:
x = pd.Categorical(df.day, categories=['Thur', 'Fri', 'Sat', 'Sun'],
              ordered=True)

#เรียงลำดับตามที่เรากำหนด

In [10]:
df['day_cat'] = x
df.head()

   total_bill   tip     sex smoker  day    time  size day_cat
0       16.99  1.01  Female     No  Sun  Dinner     2     Sun
1       10.34  1.66    Male     No  Sun  Dinner     3     Sun
2       21.01  3.50    Male     No  Sun  Dinner     3     Sun
3       23.68  3.31    Male     No  Sun  Dinner     2     Sun
4       24.59  3.61  Female     No  Sun  Dinner     4     Sun

In [11]:
df.sort_values('day_cat')

     total_bill   tip     sex smoker   day    time  size day_cat
121       13.42  1.68  Female     No  Thur   Lunch     2    Thur
133       12.26  2.00  Female     No  Thur   Lunch     2    Thur
132       11.17  1.50  Female     No  Thur   Lunch     2    Thur
131       20.27  2.83  Female     No  Thur   Lunch     2    Thur
130       19.08  1.50    Male     No  Thur   Lunch     2    Thur
..          ...   ...     ...    ...   ...     ...   ...     ...
158       13.39  2.61  Female     No   Sun  Dinner     2     Sun
157       25.00  3.75  Female     No   Sun  Dinner     4     Sun
156       48.17  5.00    Male     No   Sun  Dinner     6     Sun
186       20.90  3.50  Female    Yes   Sun  Dinner     3     Sun
0         16.99  1.01  Female     No   Sun  Dinner     2     Sun

[244 rows x 8 columns]

## See of groupby is sorted too

In [13]:
df.groupby('day').size()
#Not sorted

day
Fri     19
Sat     87
Sun     76
Thur    62
dtype: int64

In [14]:
df.groupby('day_cat').size()
#Sorted!!

C:\Users\spire\AppData\Local\Temp\ipykernel_115276\1031966495.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('day_cat').size()

day_cat
Thur    62
Fri     19
Sat     87
Sun     76
dtype: int64

## Managing categories

In [16]:
df.day_cat.cat.categories

Index(['Thur', 'Fri', 'Sat', 'Sun'], dtype='object')

In [19]:
s = df.day_cat.cat.add_categories('Wed')
s

0       Sun
1       Sun
2       Sun
3       Sun
4       Sun
       ...
239     Sat
240     Sat
241     Sat
242     Sat
243    Thur
Name: day_cat, Length: 244, dtype: category
Categories (5, object): ['Thur' < 'Fri' < 'Sat' < 'Sun' < 'Wed']

In [21]:
s.cat.remove_categories('Thur')
#ค่าที่เป็น Thur ก็จะเป็น NaN (ระวัง)

0      Sun
1      Sun
2      Sun
3      Sun
4      Sun
      ...
239    Sat
240    Sat
241    Sat
242    Sat
243    NaN
Name: day_cat, Length: 244, dtype: category
Categories (4, object): ['Fri' < 'Sat' < 'Sun' < 'Wed']

In [23]:
s.cat.reorder_categories(['Wed','Thur','Fri','Sat','Sun'])

0       Sun
1       Sun
2       Sun
3       Sun
4       Sun
       ...
239     Sat
240     Sat
241     Sat
242     Sat
243    Thur
Name: day_cat, Length: 244, dtype: category
Categories (5, object): ['Wed' < 'Thur' < 'Fri' < 'Sat' < 'Sun']

In [26]:
s.cat.as_unordered
s
#ยกเลิกการเรียงลำดับ

0       Sun
1       Sun
2       Sun
3       Sun
4       Sun
       ...
239     Sat
240     Sat
241     Sat
242     Sat
243    Thur
Name: day_cat, Length: 244, dtype: category
Categories (5, object): ['Thur' < 'Fri' < 'Sat' < 'Sun' < 'Wed']